In [1]:
#from flask.ext.sqlalchemy import SQLAlchemy
#from flask_sqlalchemy import SQLAlchemy
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

# result_set = db.execute("SELECT * FROM city")  
# for r in result_set:  
#     print(r)

In [2]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

# df = pd.read_sql("select * from city",con=connection)
# print(df

In [3]:
# 1. Ile kategorii filmow mamy w wypozyczalni?

df1 = pd.read_sql("select distinct count(*) from category",con=connection)
print(df1)

   count
0     16

In [4]:
# 2. Wyświetl listę kategorii w kolejności alfabetycznej

df2 = pd.read_sql("select distinct name from category order by name ASC",con=connection)
print(df2)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

In [5]:
# 3. Znajdź najstarszy i najmłodszy film do wypożyczenia

df3 = pd.read_sql("select release_year from film where release_year = (select max(release_year) from film) or release_year = (select min(release_year) from film)", con=connection)
print(df3)

     release_year
0            2006
1            2006
2            2006
3            2006
4            2006
..            ...
995          2006
996          2006
997          2006
998          2006
999          2006

[1000 rows x 1 columns]

In [6]:
# 4. Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

df4 = pd.read_sql("select count(rental_date) from rental where rental_date between '2005-07-01 00:00:00' and '2005-08-01 23:59:59'", con=connection)
print(df4)

   count
0   7380

In [7]:
# 5. Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

df5 = pd.read_sql("select count(rental_date) from rental where rental_date between '2010-01-01' AND '2011-02-01'", con=connection)
print(df5)

   count
0      0

In [8]:
# 6. Znajdź największą płatność wypożyczenia.

df6 = pd.read_sql("select amount from payment where amount = (select max(amount) from payment)", con=connection)
print(df6)

   amount
0   11.99
1   11.99
2   11.99
3   11.99
4   11.99
5   11.99
6   11.99
7   11.99

In [9]:
# 7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

df7 = pd.read_sql("select first_name, last_name, country from customer left join address on customer.address_id = address.address_id left join city on address.city_id = city.city_id left join country on city.country_id = country.country_id where country='Poland' or country='Nigeria' or country='Bangladesh'", con=connection)
print(df7)

   first_name  last_name     country
0       Sonia    Gregory     Nigeria
1       Brian      Wyman      Poland
2      Sidney   Burleson      Poland
3      Rodney    Moeller     Nigeria
4     Stephen     Qualls  Bangladesh
5       Velma      Lucas     Nigeria
6     Marilyn       Ross     Nigeria
7       Elsie     Kelley     Nigeria
8      Gladys   Hamilton     Nigeria
9       Frank   Waggoner  Bangladesh
10   Marjorie     Tucker      Poland
11      Carol     Garcia     Nigeria
12       Leah     Curtis      Poland
13      Ruben      Geary      Poland
14       Olga    Jimenez     Nigeria
15     Bertha   Ferguson     Nigeria
16     Tracey    Barrett     Nigeria
17         Jo     Fowler     Nigeria
18    Johnnie   Chisholm      Poland
19    Wallace      Slone     Nigeria
20   Michelle      Clark  Bangladesh
21    Russell    Brinson      Poland
22     Jimmie  Eggleston      Poland
23  Constance       Reid     Nigeria

In [10]:
# 8. Gdzie mieszkają członkowie personelu?

df8 = pd.read_sql("select first_name, last_name, address, city, district from staff left join address on staff.address_id = address.address_id left join city on address.city_id = city.city_id", con=connection)
print(df8)

  first_name last_name               address        city district
0       Mike   Hillyer     23 Workhaven Lane  Lethbridge  Alberta
1        Jon  Stephens  1411 Lillydale Drive   Woodridge      QLD

In [11]:
# 9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?

df9 = pd.read_sql("select count(staff_id) from staff left join address on staff.address_id = address.address_id left join city on address.city_id = city.city_id left join country on city.country_id = country.country_id where country='Argentina' or country='Spain'", con=connection)
print(df9)

   count
0      0

In [12]:
# 10. Jakie kategorie filmów zostały wypożyczone przez klientów?

df10 = pd.read_sql("select distinct name from category", con=connection)
print(df10)

           name
0        Comedy
1         Drama
2        Horror
3        Sci-Fi
4      Classics
5       Foreign
6         Games
7           New
8        Travel
9        Action
10        Music
11  Documentary
12       Sports
13    Animation
14     Children
15       Family

In [13]:
# 11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

df11 = pd.read_sql("select name from category where category_id in (select category_id from film_category where film_id in (select film_id from film where film_id in (select film_id from inventory where inventory_id in (select inventory_id from rental where customer_id in (select customer_id from customer where address_id in (select address_id from address where city_id in (select city_id from city where country_id in (select country_id from country where country = 'United States'))))))))", con=connection)
print(df11)

           name
0        Family
1        Travel
2        Sports
3      Classics
4        Action
5           New
6        Comedy
7        Horror
8      Children
9        Sci-Fi
10        Music
11        Games
12      Foreign
13  Documentary
14    Animation
15        Drama

In [14]:
# 12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

df12 = pd.read_sql("select title, first_name, last_name from film left join film_actor on film.film_id = film_actor.film_id left join actor on film_actor.actor_id = actor.actor_id where (first_name || ' ' || last_name) = 'Julia Zellweger' or (first_name || ' ' || last_name) = 'Olympia Pfeiffer' or (first_name || ' ' || last_name) = 'Ellen Presley'", con=connection)
print(df12)

                title first_name  last_name
0     Bilko Anonymous      Ellen    Presley
1   Caribbean Liberty      Ellen    Presley
2    Casper Dragonfly      Ellen    Presley
3    Empire Malkovich      Ellen    Presley
4       Floats Garden      Ellen    Presley
..                ...        ...        ...
64       Outlaw Hanky      Julia  Zellweger
65    Panky Submarine      Julia  Zellweger
66   Rider Caddyshack      Julia  Zellweger
67          Won Dares      Julia  Zellweger
68      Wyoming Storm      Julia  Zellweger

[69 rows x 3 columns]